# list تقبل انواع مختلفة من البيانات بداخلها
items  = ["a" , "b" , "c" , "d" , "e" , "f" , 1 , 5.3 , True]
# index =  0 ,   1  ,  2  ,  3  ,  4  ,  5  , 6 ,  7  ,  8
#    or
# index = -9 ,  -8  , -7  , -6  , -5  , -4 , -3 , -2 ,  -1
# طباعة list كاملة
print(items)

# طباعة عنصر واحد
print(items[5])

# طباعة مجموعة من العناصر بواسطة [:]
# [ start :  stop ]
# [ البداية   : التوقف  ]
#  اذا لم يتم تحديد start و stop ، يتم اعتبار start = 0 اي البداية و stop = len(items) أو 9
print(items[:])

# [1:4] ----> يبدأ من العنصر الموجود في الموقع 1 وينتهي عند العنصر الموجود في الموقع 3
# ( ملاحظة 4 نقطة التوقف لذلك لا تطبع )
print(items[1:4]) # ['b','c','d']

# من الممكن ان يتك الطباعة من العكس بواسطة العناوين ( index ) السالبة
# start = -4  stop = -1 ( ملاحظة لا يتم طباعة العنصر الموجود في -1 لانه نقطة التوقف )
print(items[-4:-1])# ['f', 1 , 5.3]

# start = 3 , stop غير محدد اي stop = len(item)
print(items[3:]) # ['d', 'e', 'f', 1, 5.3, True]

# طالما لم يتم تحديد start فيتم اعتبار start = 0
print(items[:5]) # ['a', 'b', 'c', 'd', 'e']


