# list تقبل انواع مختلفة من البيانات بداخلها
items  = ["a" , "b" , "c" , "d" , "e" , "f" , 1 , 5.3 , True]
# index =  0 ,   1  ,  2  ,  3  ,  4  ,  5  , 6 ,  7  ,  8
#    or
# index = -9 ,  -8  , -7  , -6  , -5  , -4 , -3 , -2 ,  -1

print("Before : ")
print(items)


print("After  : ")
# تعديل العنصر الموجود في العنوان 3 من d الى aaa
items[3] = "aaa" # ["a" , "b" , "c" , "aaa" , "e" , "f" , 1 , 5.3 , True]
print(items)

# تعديل العناصر الموجودة في العناوين 4 و 5 و 6 من "e" , "f" , 1 الى 100 , 200 , 300
items[4:7] = [ 100 , 200 , 300 ] # ["a" , "b" , "c" , "aaa" , 100 , 200 , 300 , 5.3 , True]
print(items)

