# list تقبل انواع مختلفة من البيانات بداخلها
items  = ["a" , "b" , "c" , "d" , "e" , "f" , 1 , 5.3 , True]
# index =  0 ,   1  ,  2  ,  3  ,  4  ,  5  , 6 ,  7  ,  8
#    or
# index = -9 ,  -8  , -7  , -6  , -5  , -4 , -3 , -2 ,  -1

num = [1,2,3,4]


# تضيف العنصر الجديد الى اخر list
items.append(1500) # ["a" , "b" , "c" , "d" , "e" , "f" , 1 , 5.3 , True]
print(items)

# تضيف العنصر الجديد في العنوان 2 والعنصر السابق للموقع 2 يتم ازاحنه الى الموقع 3
items.insert(2,2500) # ["a" , "b" , 2500 , "c" , "d" , "e" , "f" , 1 , 5.3 , True , 1500]
print(items)

# اضافة num الى داخل items ككتلة واحدة
items.append(num) # ["a" , "b" , 2500 , "c" , "d" , "e" , "f" , 1 , 5.3 , True , 1500 , [1,2,3,4]]
print(items)

# يتم اضافة عناصر num كعناصر مستقلة بداخل items
items.extend(num) # ["a" , "b" , 2500 , "c" , "d" , "e" , "f" , 1 , 5.3 , True , 1500 , [1,2,3,4] , 1,2,3,4]
print(items)