# list تقبل انواع مختلفة من البيانات بداخلها
items  = ["a" , "b" , "c" , "d" , "e" , "f" , 1 , 5.3 , True]
# index =  0 ,   1  ,  2  ,  3  ,  4  ,  5  , 6 ,  7  ,  8
#    or
# index = -9 ,  -8  , -7  , -6  , -5  , -4 , -3 , -2 ,  -1

# طباعة مجموعة من العناصر بواسطة [::]
# [ start :  stop : step ]
# [ البداية   : التوقف  : الخطوة ]
#    القيم الافتراضية اذا لم يتم كتابة اي شي كالتالي :
# [ 0   : len(items)  : 1 ]     len(items)----> 9 ---> طول list
print(items[::])

# طباعة list بالعكس من الاخير الى الاول
print(items[::-1])

# items[1:4] == items[1:4:1] ---> يتم طباعة العناصر من العنوان 1 الى العنوان 3
print(items[1:4]) # ['b', 'c', 'd']

# يبدأ من العنوان -8 الى العنوان -5  items[-8:-5] == items[-8:-5:1]
print(items[-8:-5]) # ['b', 'c', 'd']

# يتم طباعة العناصر من العنوان 4 الى العنوان 1 ( بشكل عكسي )
print(items[4:0:-1]) # ['e', 'd', 'c', 'b']